 # DataFrame
 
 DataFrame'ler, verileri tablo şeklinde düzenlememizi sağlar. Satırlar genellikle gözlemleri (örneğin, öğrenciler), sütunlar ise değişkenleri (örneğin, notlar, isimler) temsil eder.



Sütun İşlemleri: Yeni sütunlar ekleyebilir, mevcut sütunları silebilir veya güncelleyebilirsiniz.
İstatistiksel Hesaplamalar: Ortalama, standart sapma gibi istatistiksel hesaplamalar yapabilirsiniz.
Sıralama: Verileri belirli bir sütuna göre sıralayabilirsiniz.
Filtreleme: Belirli koşulları sağlayan satırları seçebilirsiniz.

### DataFrame Oluşturma

In [46]:
import pandas as pd
import numpy as np

In [47]:
ogr = {
    'isim': ['Arda', 'Beyza', 'Cansu', 'Deniz', 'Eda'],
    'yazili': [78,36,75,45,73],
    'sozlu': [56,75,34,87,56]
}

for (key, value) in ogr.items():
  print(f'{key}: {value}')

isim: ['Arda', 'Beyza', 'Cansu', 'Deniz', 'Eda']
yazili: [78, 36, 75, 45, 73]
sozlu: [56, 75, 34, 87, 56]

In [48]:
type(ogr)

dict

In [49]:
ogrenci_df = pd.DataFrame(ogr)
print(ogrenci_df)

    isim  yazili  sozlu
0   Arda      78     56
1  Beyza      36     75
2  Cansu      75     34
3  Deniz      45     87
4    Eda      73     56

In [50]:
print(type(ogrenci_df))

<class 'pandas.core.frame.DataFrame'>

#### Rastgele Sayılarla DataFrame Oluşturma

In [51]:
data = np.random.rand(10, 4) # NumPy ile 10 satır, 4 sütundan oluşan, 0-1 arası rastgele sayılar içeren bir NumPy array'i oluşturur.
columns_listesi = ['A', 'B', 'C', 'D'] # Sütun isimlerini tutan bir liste oluşturur.
df = pd.DataFrame(data, columns = columns_listesi) # array'i ve sütun isimlerini kullanarak bir Pandas DataFrame'i oluşturur.
print(df)

          A         B         C         D
0  0.322621  0.053467  0.347471  0.254484
1  0.242809  0.569982  0.731986  0.996839
2  0.844314  0.040009  0.683398  0.920240
3  0.746891  0.057476  0.939243  0.401900
4  0.526540  0.356157  0.759893  0.808586
5  0.755893  0.542365  0.536512  0.835335
6  0.796514  0.747568  0.440755  0.825895
7  0.625088  0.012434  0.701050  0.858945
8  0.048989  0.021969  0.160830  0.646379
9  0.613713  0.174277  0.307670  0.532439

### Yeni Sütun Ekleme

In [52]:
ogrenci_df = pd.DataFrame(ogr, columns=['isim', 'yazili','sozlu', 'ortalama'])
print(ogrenci_df)

    isim  yazili  sozlu ortalama
0   Arda      78     56      NaN
1  Beyza      36     75      NaN
2  Cansu      75     34      NaN
3  Deniz      45     87      NaN
4    Eda      73     56      NaN

In [53]:
ogrenci_df['ortalama'] = ogrenci_df['yazili'] * 0.6 + ogrenci_df['sozlu'] * 0.4
print(ogrenci_df)

    isim  yazili  sozlu  ortalama
0   Arda      78     56      69.2
1  Beyza      36     75      51.6
2  Cansu      75     34      58.6
3  Deniz      45     87      61.8
4    Eda      73     56      66.2

In [54]:
print(ogrenci_df['ortalama'][4])

66.2

##### Bir başka yeni sütun ekleme

In [55]:
ogrenci_df['numara'] = 0

print (ogrenci_df)

    isim  yazili  sozlu  ortalama  numara
0   Arda      78     56      69.2       0
1  Beyza      36     75      51.6       0
2  Cansu      75     34      58.6       0
3  Deniz      45     87      61.8       0
4    Eda      73     56      66.2       0

### Sütun Silme

In [56]:
ogrenci_df = ogrenci_df.drop('numara', axis=1)
print (ogrenci_df)

    isim  yazili  sozlu  ortalama
0   Arda      78     56      69.2
1  Beyza      36     75      51.6
2  Cansu      75     34      58.6
3  Deniz      45     87      61.8
4    Eda      73     56      66.2

### Verilere Erişme

 .loc: Etiketlere göre seçim yapar.
.iloc: Numaralı indekslere göre seçim yapar.

In [57]:
s = pd.Series(list("abcdef"), index=[49, 48, 47, 0, 1, 2]) 
print (s)

print (s.loc[0])    # value at index label 0
print (s.iloc[0])   # value at index location 0

49    a
48    b
47    c
0     d
1     e
2     f
dtype: object
d
a

In [58]:
print(ogrenci_df.loc[4])

isim         Eda
yazili        73
sozlu         56
ortalama    66.2
Name: 4, dtype: object

In [59]:
print (ogrenci_df.iloc[4])

isim         Eda
yazili        73
sozlu         56
ortalama    66.2
Name: 4, dtype: object

In [60]:
ogrenci_df['ortalama'] = ogrenci_df['yazili'] * 0.6 + ogrenci_df['sozlu'] * 0.4
print(ogrenci_df['ortalama'][4])
print(ogrenci_df)

66.2
    isim  yazili  sozlu  ortalama
0   Arda      78     56      69.2
1  Beyza      36     75      51.6
2  Cansu      75     34      58.6
3  Deniz      45     87      61.8
4    Eda      73     56      66.2

In [61]:
print (ogrenci_df)

    isim  yazili  sozlu  ortalama
0   Arda      78     56      69.2
1  Beyza      36     75      51.6
2  Cansu      75     34      58.6
3  Deniz      45     87      61.8
4    Eda      73     56      66.2

In [62]:
ogrenci_df['ortalama'] = ogrenci_df['yazili'] * 0.6 + ogrenci_df['sozlu'] * 0.4
print(ogrenci_df['ortalama'][4])
print ()
print (ogrenci_df["ortalama"])
print ()
print (ogrenci_df[["ortalama", "isim"]])

66.2

0    69.2
1    51.6
2    58.6
3    61.8
4    66.2
Name: ortalama, dtype: float64

   ortalama   isim
0      69.2   Arda
1      51.6  Beyza
2      58.6  Cansu
3      61.8  Deniz
4      66.2    Eda

In [63]:
basarili_ogrenciler = ogrenci_df[ogrenci_df['ortalama']>66]
print(basarili_ogrenciler)

   isim  yazili  sozlu  ortalama
0  Arda      78     56      69.2
4   Eda      73     56      66.2

In [64]:
ogrenci_df

    isim  yazili  sozlu  ortalama
0   Arda      78     56      69.2
1  Beyza      36     75      51.6
2  Cansu      75     34      58.6
3  Deniz      45     87      61.8
4    Eda      73     56      66.2

### DataFrame Methodlar

In [65]:
df = pd.DataFrame(np.arange(0, 15).reshape(5, 3),
                                 index=['a', 'b', 'c', 'd', 'e'],
                                 columns=['c1', 'c2', 'c3'])

df

   c1  c2  c3
a   0   1   2
b   3   4   5
c   6   7   8
d   9  10  11
e  12  13  14

#### Kolon Ekleme

In [66]:
df['c4'] = np.nan
df

   c1  c2  c3  c4
a   0   1   2 NaN
b   3   4   5 NaN
c   6   7   8 NaN
d   9  10  11 NaN
e  12  13  14 NaN

#### Satır Ekleme

In [67]:
df.loc['f'] = np.arange(15, 19)
df

   c1  c2  c3    c4
a   0   1   2   NaN
b   3   4   5   NaN
c   6   7   8   NaN
d   9  10  11   NaN
e  12  13  14   NaN
f  15  16  17  18.0

In [68]:
df.loc['g'] = np.nan
df

     c1    c2    c3    c4
a   0.0   1.0   2.0   NaN
b   3.0   4.0   5.0   NaN
c   6.0   7.0   8.0   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   NaN
f  15.0  16.0  17.0  18.0
g   NaN   NaN   NaN   NaN

#### Değer Ekleme

In [69]:
df['c5'] = np.nan
df
# Yanlış yöntem
# df['c4']['a'] = 20
# Doğru yöntem
df.loc['a', 'c4'] = 20
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

#### Uyarı Mesajı ve Çözümü

Aldığımız uyarı mesajı Chained Assignment (Zincirleme Atama) Uyarısı: Kodda, bir veri çerçevesindeki (DataFrame) bir sütunu güncellemek için birden fazla adımda atama işlemi yapıldığında örneğin, önce sütunu seçip ardından bu seçili sütuna yeni değerler atandığında, gelecekteki Pandas sürümlerinde (özellikle 3.0 ve sonrası) beklenmedik sonuçlara yol açabileceğini belirtiyor. ÇünküPandas 3.0 sürümünden itibaren, bu zincirlenmiş atama yöntemi artık orijinal veri çerçevesini güncellemeyecek bunun yerine, yeni bir kopya oluşturacak ve değişiklikler bu kopya üzerinde yapılacaktır. Bu durum, beklenmedik sonuçlara ve hatalara yol açabilir.
Uyarı mesajında önerildiği gibi, df.loc[row_indexer, "col"] = values şeklinde tek adımda atama işlemi yapmanız önerilir. Bu sayede, hem orijinal veri çerçevesi güncellenir hem de gelecekteki Pandas sürümlerinde de sorun yaşamazsınız. Örnek uygulama:

In [70]:
import pandas as pd

dataf = pd.DataFrame({'col1': [1, 2, 3]})
print (dataf)
# Yanlış (Zincirlenmiş Atama):
# dataf["col1"] = dataf["col1"] * 2

# Doğru (Tek Adımda Atama):
dataf.loc[:, "col1"] = dataf["col1"] * 2
print (dataf)

   col1
0     1
1     2
2     3
   col1
0     2
1     4
2     6

### Eksik Değerler ve Manipülasyonları

df.isnull(): This part creates a new DataFrame with the same dimensions as df. Each element in the new DataFrame is True if the corresponding element in df is null (missing or NaN), and False otherwise.

.sum(): This method is applied to the new DataFrame.
It sums the values in each column, treating True as 1 and False as 0.

In [71]:
df.isnull().sum()

c1    1
c2    1
c3    1
c4    5
c5    7
dtype: int64

In [72]:
print (df)

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [73]:
df.isnull().sum().sum()

15

In [74]:
df.c4.dropna() # filters the c4 column of the DataFrame df and removes rows containing null values.

a    20.0
f    18.0
Name: c4, dtype: float64

df.dropna(): This function is used to remove rows or columns containing null values.

how="all": This parameter specifies that a column will be dropped only if all of its values are null. If any value in a column is non-null, the column will be retained.

axis=1": This parameter indicates that the operation should be performed on the columns of the DataFrame. If axis=0, the operation would be performed on the rows.

In [75]:
df.dropna(how="all", axis=1) # removes columns from the DataFrame df that contain only null values.

     c1    c2    c3    c4
a   0.0   1.0   2.0  20.0
b   3.0   4.0   5.0   NaN
c   6.0   7.0   8.0   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   NaN
f  15.0  16.0  17.0  18.0
g   NaN   NaN   NaN   NaN

In [76]:
df.dropna(how="all", axis=0)

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN

#### Copying A Dataframe

In [77]:
df2 = df.copy()
df2

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [78]:
df2.loc['g'].c1 = 0
df2.loc['g'].c3 = 0
df2

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   0.0   NaN   0.0   NaN NaN

In [79]:
df2.dropna(how="any", axis=1) # # removes columns from the DataFrame if contains any null values.

     c1    c3
a   0.0   2.0
b   3.0   5.0
c   6.0   8.0
d   9.0  11.0
e  12.0  14.0
f  15.0  17.0
g   0.0   0.0

In [80]:
filled = df.fillna(0) # Fills null values with O
filled

     c1    c2    c3    c4   c5
a   0.0   1.0   2.0  20.0  0.0
b   3.0   4.0   5.0   0.0  0.0
c   6.0   7.0   8.0   0.0  0.0
d   9.0  10.0  11.0   0.0  0.0
e  12.0  13.0  14.0   0.0  0.0
f  15.0  16.0  17.0  18.0  0.0
g   0.0   0.0   0.0   0.0  0.0

In [81]:
df.mean() # Sütunların ortalama değerin

c1     7.5
c2     8.5
c3     9.5
c4    19.0
c5     NaN
dtype: float64

- df.mean() sadece sayısal sütunlarda çalışır. 
- Metin veya kategorik verilerde kullanılamaz.
- Eğer DataFrame'de eksik değerler (NaN) varsa, df.mean() bu değerleri dikkate almaz ve hesaplama yaparken onları atlar.
- Eğer tüm sütunların ortalamasını almak isterseniz, df.mean() kullanabilirsiniz. Belirli bir sütunun ortalamasını almak için ise df['sütun_adı'].mean() şeklinde kullanabilirsiniz.

In [82]:
filled.mean()

c1    6.428571
c2    7.285714
c3    8.142857
c4    5.428571
c5    0.000000
dtype: float64

DataFrame'indeki eksik değerleri (NaN) o sütunun ortalaması ile doldurur. Yani, her bir sütündaki eksik değerler, o sütündaki tüm sayısal değerlerin ortalaması ile değiştirilir.

df.mean(): Bu kısım, DataFrame'deki tüm sayısal sütunların ortalamalarını hesaplar ve bir Series (seri) olarak döndürür. Bu seri, her bir sütunun ortalamasını içerir.
df.fillna(): Bu kısım ise, DataFrame'deki eksik değerleri belirtilen bir değerle doldurmak için kullanılır. Bu durumda, df.mean() ile elde edilen ortalamalar serisi buraya parametre olarak verilir.
Birlikte Çalışması: Öncelikle her sütunun ortalaması hesaplanır. Sonra DataFrame'deki her bir eksik değer, ait olduğu sütunun ortalaması ile değiştirilir.

Neden Kullanılır?

Eksik Veri Problemi: Eksik veriler, veri analizinde sorunlara neden olabilir. Bu kod, eksik verileri tahmini bir değerle doldurarak bu sorunu çözmeye yardımcı olur.
Veri Temizleme: Veri setini daha temiz ve tutarlı hale getirmek için kullanılır.
Makine Öğrenmesi: Makine öğrenmesi modellerinin çalışabilmesi için verinin eksiksiz olması genellikle gereklidir. Bu kod, eksik verileri doldurarak modelleri eğitmeye hazır hale getirir.
Dikkat Edilmesi Gerekenler:

Tüm Eksik Değerler Aynı Değerle Doldurulur: Bu yöntem, tüm eksik değerler için aynı yaklaşımı kullanır. Ancak bazı durumlarda, farklı sütunlar için farklı doldurma yöntemleri daha uygun olabilir.
Yanlış Tahminler: Eğer eksik verilerin oluşma nedeni sistematik bir hata ise, ortalama ile doldurma yanlış sonuçlara neden olabilir.
Diğer Doldurma Yöntemleri: Ortalama yerine medyan, mod veya daha gelişmiş yöntemler (örneğin, k-nearest neighbors) de kullanılabilir.
Özetle:

df.fillna(df.mean()) kodu, Pandas DataFrame'lerindeki eksik değerleri o sütunun ortalaması ile doldurmak için kullanılan pratik bir yöntemdir. Ancak, her veri setinde en uygun doldurma yönteminin seçilmesi önemlidir.

In [83]:
df.fillna(df.mean())

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0  19.0 NaN
c   6.0   7.0   8.0  19.0 NaN
d   9.0  10.0  11.0  19.0 NaN
e  12.0  13.0  14.0  19.0 NaN
f  15.0  16.0  17.0  18.0 NaN
g   7.5   8.5   9.5  19.0 NaN

Aşağıdaki kod, df DataFrame'indeki c4 sütunundaki eksik değerleri (NaN), kendinden önceki (yukarıdaki) ilk geçerli değerle doldurur. Yani, bir eksik değer gördüğünde, hemen üstündeki dolu olan hücrenin değerini alır ve eksik değerin yerine yazar.

Adım Adım Açıklama:

df.c4: Bu kısım, df DataFrame'indeki c4 sütununu seçer.
fillna(method="ffill"): Bu kısım, seçilen sütündaki eksik değerleri doldurmak için kullanılır.
method="ffill": Bu parametre, eksik değerlerin nasıl doldurulacağını belirtir. "ffill" (forward fill) yöntemi, eksik değerleri yukarıdan aşağıya doğru doldurur. Yani, bir eksik değer gördüğünde, hemen üstündeki dolu olan hücrenin değerini alır.

Neden Kullanılır?

Zaman Serileri: Zaman serilerinde, eksik değerler genellikle önceki değerin devamı olduğu varsayımıyla doldurulur.
Sıralı Veriler: Verilerin bir sırası veya birbiriyle ilişkili olduğu durumlarda, bu yöntem anlamlı sonuçlar verebilir.
Eksik Verilerin Doğrusal Olduğu Durumlar: Eğer eksik değerler, eksik olmayan değerlerin ortasında bulunuyorsa ve genel eğilim doğrusalsa, bu yöntem iyi sonuçlar verebilir.
Dikkat Edilmesi Gerekenler:

Yanlış Tahminler: Eğer eksik değerlerin oluşma nedeni rastgele veya düzensiz ise, bu yöntem yanlış tahminlere neden olabilir.
Başlangıçtaki Eksik Değerler: İlk satırdaki bir değer eksikse, "ffill" yöntemi bu değeri dolduramaz.
Diğer Doldurma Yöntemleri: "bfill" (backward fill), "interpolate" gibi farklı doldurma yöntemleri de kullanılabilir.

In [84]:
# df.c4.fillna(method="ffill")
# Yukarıdaki Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead. uyarısı veriyor.
df.c4.fillna(method="ffill")

df.c4.ffill()

C:\Users\ACER\AppData\Local\Temp\ipykernel_31060\1474296502.py:3: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.c4.fillna(method="ffill")

a    20.0
b    20.0
c    20.0
d    20.0
e    20.0
f    18.0
g    18.0
Name: c4, dtype: float64